const main = require('./1915_가장 큰 정사각형2');

test('1915: 가장 큰 정사각형 case 1', () => {
  expect(main('4 4\n0100\n0111\n1110\n0010')).toBe(4);
});

test('1915: 가장 큰 정사각형 case 2', () => {
  expect(main('4 5\n01000\n01110\n11100\n00100')).toBe(4);
});

test('1915: 가장 큰 정사각형 case 3', () => {
  expect(main('5 5\n11111\n10001\n10001\n10101\n11111')).toBe(25);
});

test('1915: 가장 큰 정사각형 case 4', () => {
  expect(main('4 4\n0100\n0110\n0010\n0010')).toBe(1);
});

test('1915: 가장 큰 정사각형 case 5', () => {
  expect(
    main(
      '6 50\n01010101010101010101010101010101010101010101010101\n10101010101010101010101010101010101010101010101010\n01010101010101010101010101010101010101010101010101\n10101010101010101010101010101010101010101010101010\n01010101010101010101010101010101010101010101010101\n10101010101010101010101010101010101010101010101010'
    )
  ).toBe(1);
});

test('1915: 가장 큰 정사각형 case 6', () => {
  expect(main('3 6\n000100\n011110\n011111')).toBe(4);
});

test('1915: 가장 큰 정사각형 case 7', () => {
  expect(main('4 5\n00001\n01111\n01111\n01111')).toBe(9);
});
test('1915: 가장 큰 정사각형 case 8', () => {
  expect(main('5 7\n0000001\n0000011\n0011111\n0111111\n0111111')).toBe(9);
});

test('1915: 가장 큰 정사각형 case 9', () => {
  expect(main('6 7\n0000101\n0111111\n0111111\n0111111\n0111111\n0111111')).toBe(25);
});

test('1915: 가장 큰 정사각형 case 10', () => {
  expect(main('3 3\n000\n000\n000')).toBe(0);
});

test('1915: 가장 큰 정사각형 case 11', () => {
  expect(main('1 1\n1')).toBe(1);
});

test('1915: 가장 큰 정사각형 case 12', () => {
  expect(main('3 1\n0\n1\n1')).toBe(1);
});

test('1915: 가장 큰 정사각형 case 13', () => {
  expect(main('4 4\n0110\n0000\n0000\n0000')).toBe(1);
});

test('1915: 가장 큰 정사각형 case 14', () => {
  expect(main('3 3\n000\n000\n100')).toBe(1);
});
